Repository: XenonIT-army/HomeGardenShopAdmin
Catalog: HomeGardenShopAdmin/Properties/Resource.*.resx
Languages: ru_ru, uk_ua

# String1
source: Hello, I'm a bot admin of HomeGardenShop store, through me you can create new products and categories for them and much more!
ru_ru: Привет я бот админ магазина HomeGardenShop, через меня ты можешь создавать новые продукты и категории к ним и много другого!
uk_ua: Привіт я бот адмін магазину HomeGardenShop, через мене ти можеш створювати нові продукти та категорії до них та багато іншого!

# String10
source: To find news, specify the tag: "get news id"
ru_ru: Чтобы найти новость укажи тег get news id новости
uk_ua: Щоб знайти новину, вкажи тег get news id новини

# String11
source: News can be of two types: with and without a picture.\nTo create a news story with a picture, select a photo from the gallery and add a caption to it.\nFor news without a picture, you can use just a message.\nIn the text, be sure to include the tags create news nameRU:.. .;nameUA:...;nameEN:...;descRU:...;descUA:...;descEN:...; this is the title and description of the news. You can specify one title and description tag each, then the text will be duplicated in other languages.
ru_ru: Новости могут быть двух типов: с картинкой и без.\nЧто бы создать новость с картинкой выбери фото из галереи и сделай к нему подпись.\nДля новости без картинки можно использовать просто сообщение.\nВ тексте обязательно укажи теги create news nameRU:...;nameUA:...;nameEN:...;descRU:...;descUA:...;descEN:...; это название и описание новости. Можно указать по одному тегу названия и описания тогда текст продублируется на остальные языки.
uk_ua: Новини можуть бути двох типів: з картинкою і без.\пЩоб створити новину з картинкою обери фото з галереї і зроби до нього підпис.\пДля новини без картинки можна використовувати просто повідомлення.\пУ тексті обов'язково впиши теги create news nameRU: ...; nameUA: ...; nameEN: ...; nameEN: ...; descRU: ...; descUA: ...; descEN: ...; це назва і опис новини. Можна вказати по одному тегу назви й опису, тоді текст продублюється іншими мовами.

# String12
source: To remove news, specify the remove news tag and the news id.
ru_ru: Чтобы удалить новость укажи тег remove news и id новости.
uk_ua: Щоб видалити новину, вкажи тег remove news і id новини.

# String13
source: To edit the news, specify the edit news id tag of the news and any field, for example: nameRU:...;
ru_ru: Чтобы редактировать новость укажи тег edit news id новости и любое поле например: nameRU:...;
uk_ua: Щоб редагувати новину, вкажіть тег edit news id новини та будь-яке поле наприклад: nameRU:...;

# String14
source: Choose a product search filter!
ru_ru: Выбери фильтр поиска продукта!
uk_ua: Виберіть фільтр пошуку продукту!

# String15
source: To find a product by category, specify the get prod category id tags for the category.
ru_ru: Что бы найти продукт по категории укажи теги get prod category id категории.
uk_ua: Щоб знайти продукт за категорією вкажіть теги get prod category id категорії.

# String16
source: To find a product by name, specify the get prod name... tags for search keywords.
ru_ru: Что бы найти продукт по названию укажи теги get prod name... ключевые слова для поиска.
uk_ua: Щоб знайти продукт за назвою, вкажіть теги get prod name... ключові слова для пошуку.

# String17
source: To find a product by price, specify the get prod price ... price range, for example 100 - 300.
ru_ru: Что бы найти продукт по цене укажи теги get prod price ... диапазон цен, например 100 - 300.
uk_ua: Щоб знайти продукт за ціною вкажіть теги get prod price ... діапазон цін, наприклад 100 - 300.

# String18
source: To find a product by category, specify the get prod id tags for the product.
ru_ru: Что бы найти продукт по категории укажи теги get prod id продукта.
uk_ua: Щоб знайти продукт за категорією вкажи теги get prod id продукту.

# String19
source: To create a product, select a photo from the gallery and make a caption for it.\nIn the text, be sure to include the tags create prod nameRU:...;nameUA:...;nameEN:...;descRU:...;descUA:...;descEN:...;prodcount:...;categoryId:...;prodprice:...;proddiscount:...; You can specify one title and description tag each, then the text will be duplicated in other languages.
ru_ru: Что бы создать продукт выбери фото из галереи и сделай к нему подпись.\nВ тексте обязательно укажи теги create prod nameRU:...;nameUA:...;nameEN:...;descRU:...;descUA:...;descEN:...;prodcount:...;categoryId:...;prodprice:...;proddiscount:...; Можно указать по одному тегу названия и описания тогда текст продублируется на остальные языки.
uk_ua: Щоб створити продукт, вибери фото з галереї і зроби до нього підпис.\nУ тексті обов'язково вкажи теги create prod nameRU:...;nameUA:...;nameEN:...;descRU:...;descUA:.. .;descEN:...;count:...;categoryId:...;price:...;discountPrice:...; Можна вказати по одному тегу назви та опису, тоді текст продублюється на інші мови.

# String2
source: Choose a category
ru_ru: Выбери категорию
uk_ua: Вибери категорію

# String20
source: To remove a product, specify the remove prod tag and id.
ru_ru: Чтобы удалить продукт укажи тег remove prod и id.
uk_ua: Щоб видалити продукт, вкажи тег remove prod і id.

# String21
source: To edit a product, specify the edit prod id tag of the product and any field, for example: nameRU:...;price:...;
ru_ru: Чтобы редактировать продукт укажи тег edit prod id продукта и любое поле например: nameRU:...;price:...;
uk_ua: Щоб редагувати продукт вкажіть тег edit prod id продукту та будь-яке поле наприклад: nameRU:...;price:...;

# String22
source: To find a category, specify the tag get category id news
ru_ru: Чтобы найти категорию укажи тег get category id новости
uk_ua: Щоб знайти категорію, вкажи тег get category id новини

# String23
source: To create a category, specify the tags create category nameRU:...;nameUA:...;nameEN:...; You can specify one title tag, then the text will be duplicated in other languages.
ru_ru: Что бы создать категорию укажи теги create category nameRU:...;nameUA:...;nameEN:...; Можно указать один тег названия тогда текст продублируется на остальные языки.
uk_ua: Щоб створити категорію, вкажи теги create category nameRU:...;nameUA:...;nameEN:...; Можна вказати один тег назви, тоді текст продублюється на інші мови.

# String24
source: To remove a category, specify the remove category tag and the category id. Important: when deleting a category, all products of this category are also deleted!
ru_ru: Чтобы удалить категорию укажи тег remove category и id категории. Важно: при удалении категории все товары данной категории так же удаляются!
uk_ua: Щоб видалити категорію, вкажи тег remove category та id категорії. Важливо: при видаленні категорії всі товари цієї категорії також видаляються!

# String25
source: To edit a category, specify the edit category id tag of the category and any field, for example: nameRU:...;
ru_ru: Чтобы редактировать категорию укажи тег edit category id категории и любое поле например: nameRU:...;
uk_ua: Щоб редагувати категорію, вкажи тег edit category id категорії та будь-яке поле наприклад: nameRU:...;

# String26
source: Important: when creating a category about us, the previous category about us will be deleted!
ru_ru: Важно: при создании категории о нас, прошлая категория о нас удалиться!
uk_ua: Важливо: при створенні категорії про нас минула категорія про нас піти!

# String27
source: To create a category about us, specify the tags create aboutUs nameCompany:...;descriptionRU:...;descriptionUA:...;descriptionEN:...; You can specify one description tag, then the text will be duplicated in other languages.
ru_ru: Что бы создать категорию о нас укажи теги create aboutUs nameCompany:...;descriptionRU:...;descriptionUA:...;descriptionEN:...; Можно указать один тег описания тогда текст продублируется на остальные языки.
uk_ua: Щоб створити категорію про нас вкажи теги create aboutUs nameCompany:...;descriptionRU:...;descriptionUA:...;descriptionEN:...; Можна вказати один тег опису, тоді текст продублюється на інші мови.

# String28
source: To remove the about us category, specify the remove aboutUs tag.
ru_ru: Чтобы удалить категорию о нас укажи тег remove aboutUs.
uk_ua: Щоб видалити категорію про нас, вкажи тег remove aboutUs.

# String29
source: To edit the about us category, specify the edit aboutUs tag and any field, for example: nameCompany:...;
ru_ru: Чтобы редактировать категорию о нас укажи тег edit aboutUs и любое поле например: nameCompany:...;
uk_ua: Щоб редагувати категорію про нас, вкажи тег edit aboutUs і будь-яке поле наприклад: nameCompany:...;

# String3
source: You have selected a category: News!
ru_ru: Ты выбрал категорию: Новости!
uk_ua: Ти вибрав категорію: Новини!

# String30
source: The chat is closed, to start again type start. I will wait for you!
ru_ru: Чат закрыт, что бы начать заново напиши start. Буду тебя ждать!
uk_ua: Чат закритий, щоб почати знову напиши start. Чекатиму тебе!

# String31
source: This command was not found;
ru_ru: Данная команда не найдена;
uk_ua: Ця команда не знайдена;

# String32
source: News
ru_ru: Новости
uk_ua: Новини

# String33
source: Products
ru_ru: Продукты
uk_ua: Продукти

# String34
source: Categories
ru_ru: Категории
uk_ua: Категорії

# String35
source: Orders
ru_ru: Заказы
uk_ua: Замовлення

# String36
source: About Us
ru_ru: О нас
uk_ua: Про нас

# String37
source: Go out
ru_ru: Выйти
uk_ua: Вийти

# String38
source: Show all
ru_ru: Показать все
uk_ua: Показати все

# String39
source: Find
ru_ru: Найти
uk_ua: Знайти

# String4
source: What to do?
ru_ru: Что нужно сделать?
uk_ua: Що потрібно зробити?

# String40
source: Create
ru_ru: Создать
uk_ua: Створити

# String41
source: Delete
ru_ru: Удалить
uk_ua: Видалити

# String42
source: Change
ru_ru: Изменить
uk_ua: Змінити

# String43
source: Back
ru_ru: Назад
uk_ua: Назад

# String44
source: Show
ru_ru: Показать
uk_ua: Показати

# String45
source: Category
ru_ru: Категория
uk_ua: Категорія

# String46
source: Name
ru_ru: Название
uk_ua: Назва

# String47
source: Price
ru_ru: Цена
uk_ua: Ціна

# String5
source: You have selected a category: Product categories!
ru_ru: Ты выбрал категорию: Категории товаров!
uk_ua: Ви вибрали категорію: Категорії товарів!

# String6
source: You have selected a category: Products!
ru_ru: Ты выбрал категорию: Продукты!
uk_ua: Ви вибрали категорію: Продукти!

# String7
source: You have selected a category: Orders!
ru_ru: Ты выбрал категорию: Заказы!
uk_ua: Ти обрав категорію: Замовлення!

# String8
source: Sorry, this category is not yet available!
ru_ru: К сожалению данная категория пока не доступна!
uk_ua: На жаль, дана категорія поки не доступна!

# String9
source: You have chosen a category: About us!
ru_ru: Ты выбрал категорию: О нас!
uk_ua: Ти вибрав категорію: Про нас!
